package by.itstep.javatraining.revision.task;

/*	Task 01. Time Period [разность времени]
 *
 *	Даны значения двух моментов времени, принадлежащих одним и тем же суткам:
 *	часы, минуты и секунды для каждого из моментов времени.
 *	Определите, сколько секунд прошло между двумя моментами времени.
 *
 *	Примечание
 *	1) Моменты времени могут задаваться по-разному.
 *	2) Не забудьте про "защиту от дурака": если данные момента времени некорректны, то нужно возвратить -1.
 *  3) Можно попробовать решить данную задачу без использования условных конструкций.
 *
 *	Формат входных данных [input]
 *	На вход даётся три целых числа в диапазоне типа int: часы, минуты, секунды,
 *	задающие один момент времени и три целых числа, задающих ещё один момент времени.
 *
 *	Формат выходных данных [output]
 *	Возвратить число секунд между этими моментами времени или -1.
 *
 *	[ input 1]: 1 1 1 2 2 2
 *	[output 1]: 3661
 *
 *	[ input 2]: 2 2 2 1 1 1
 *	[output 2]: 3661
 *
 *	[ input 3]: 1 2 30 1 3 20
 *	[output 3]: 50
 *
 *	[ input 4]: 0 0 0 0 0 0
 *	[output 4]: 0
 *
 *	[ input 5]: 1 2 -30 1 3 20
 *	[output 5]: -1
 */

public class Task01 {
    public static int task01(int hour1, int minute1, int second1, int hour2, int minute2, int second2) {

        if (hour1 < 0 || hour1 > 23 || minute1 < 0 || minute1 > 59 || second1 < 0 || second1 > 59 ||
                hour2 < 0 || hour2 > 23 || minute2 < 0 || minute2 > 59 || second2 < 0 || second2 > 59) {
            return -1;
        }


        hour1 *= 3600;
        minute1 *= 60;
        int sum1 = hour1 + minute1 + second1;

        hour2 *= 3600;
        minute2 *= 60;
        int sum2 = hour2 + minute2 + second2;


        return Math.abs(sum1 - sum2);
    }

}